patrykSilkowski/nRF52_mash/app/main.c
/*
    MQTT-SN pub/sub example on nRF52840 Thread - adapted from Nordic SDK
    examples.

    Buttons/LEDS as input/output devices (buttons are treated as switches)
    protocol usage presented in ../tools/protocol.odt
 */

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "app_scheduler.h"
#include "app_timer.h"
#include "bsp_thread.h"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "mqttsn_client.h"
#include "thread_utils.h"

#include <openthread/thread.h>
#include <openthread/joiner.h>


#define VENDOR_NAME   "SIGMA_PS"
#define VENDOR_MODEL  "1"
#define VENDOR_SW_VER "0.0.1"
#define VENDOR_DATA   NULL
#define JOINER_PSKD   "J01NME"


#define DEFAULT_CHILD_TIMEOUT  40                                           /**< Thread child timeout [s]. */
#define DEFAULT_POLL_PERIOD    1000                                         /**< Thread Sleepy End Device polling period when MQTT-SN Asleep. [ms] */
#define NUM_SLAAC_ADDRESSES    4                                            /**< Number of SLAAC addresses. */
#define OT_JOIN_TRIES          20                                           /**< Amount of attempts to connect to the OT network */

#define SEARCH_GATEWAY_TIMEOUT 100                                          /**< MQTT-SN Gateway discovery procedure timeout in [s]. */
#define SEARCH_GATEWAY_TRIES   20                                           /**< Amount of attempts to connect to the MQTT-SN gateway */

#define SCHED_QUEUE_SIZE       32                                           /**< Maximum number of events in the scheduler queue. */
#define SCHED_EVENT_DATA_SIZE  APP_TIMER_SCHED_EVENT_DATA_SIZE              /**< Maximum app_scheduler event size. */

#define APP_TIM_JOINER_DELAY 200
#define APP_TIMER_TICKS_TIMEOUT APP_TIMER_TICKS(50)


static mqttsn_client_t      m_client;                                       /**< An MQTT-SN client instance. */
static mqttsn_remote_t      m_gateway_addr;                                 /**< A gateway address. */
static uint8_t              m_gateway_id;                                   /**< A gateway ID. */
static mqttsn_connect_opt_t m_connect_opt;                                  /**< Connect options for the MQTT-SN client. */
static uint16_t             m_msg_id               = 0;                     /**< Message ID thrown with MQTTSN_EVENT_TIMEOUT. */
static uint8_t              m_gateway_search_tries = SEARCH_GATEWAY_TRIES;  /**< Down-counter of gateway searching attempts */

// THESE SHOULD BE CHANGED ACCORDING TO PROTOCOL ASSUMPTIONS
// CLIENT ID IS BASED ON EUI64
static otNetifAddress m_slaac_addresses[NUM_SLAAC_ADDRESSES];               /**< Buffer containing addresses resolved by SLAAC */

static char                 m_client_id[]          = "nRF52840";            /**< The MQTT-SN Client's ID. */
static char                 m_topic_name_pub[]     = "nRF52840/data";       /**< Name of the topic corresponding to subscriber's BSP_LED_2. */
static mqttsn_topic_t       m_topic_pub            =                        /**< Topic corresponding to subscriber's BSP_LED_2. */
{
    .p_topic_name = (unsigned char *)m_topic_name_pub,
    .topic_id     = 0,
};

static char                 m_topic_name_sub[]     = "nRF52840/cmd";        /**< Name of the topic corresponding to subscriber's BSP_LED_2. */
static mqttsn_topic_t       m_topic_sub            =                        /**< Topic corresponding to subscriber's BSP_LED_2. */
{
    .p_topic_name = (unsigned char *)m_topic_name_sub,
    .topic_id     = 0,
};

static bool g_sub_registered = false;
static bool g_led_2_on = false;
static bool g_led_3_on = false;

static uint8_t m_ot_join_tries = OT_JOIN_TRIES;                             /**< Down-counter of OT network searching attempts */

/***************************************************************************************************
 * @section scheduler prototypes
 **************************************************************************************************/

static void sched_joiner(void * p_event_data, uint16_t event_size);
static void sched_print_ip(void * p_event_data, uint16_t event_size);
static void sched_mqttsn_gw_search(void * p_event_data, uint16_t event_size);
//static void sched_get_device_data(void * p_event_data, uint16_t event_size);


/***************************************************************************************************
 * @section app prototypes
 **************************************************************************************************/
static void joiner_start(void * p_context);
static void print_ip_info(void);


/***************************************************************************************************
 * @section OpenThread
 **************************************************************************************************/


/**@brief Function for indicating Thread state change.
 */
static void state_changed_callback(uint32_t flags, void * p_context)
{
    NRF_LOG_INFO("State changed! Flags: 0x%08x Current role: %d\r\n",
                 flags, otThreadGetDeviceRole(p_context));

    if (flags & OT_CHANGED_THREAD_NETDATA)
    {
        /**
         * Whenever Thread Network Data is changed, it is necessary to check if generation of global
         * addresses is needed. This operation is performed internally by the OpenThread CLI module.
         * To lower power consumption, the examples that implement Thread Sleepy End Device role
         * don't use the OpenThread CLI module. Therefore otIp6SlaacUpdate util is used to create
         * IPv6 addresses.
         */
         otIp6SlaacUpdate(thread_ot_instance_get(), m_slaac_addresses,
                          sizeof(m_slaac_addresses) / sizeof(m_slaac_addresses[0]),
                          otIp6CreateRandomIid, NULL);
    }
}


/**@brief Function for initializing the Thread Stack.
 */
static void thread_instance_init(void)
{
    thread_configuration_t thread_configuration =
    {
        .role                  = RX_ON_WHEN_IDLE,
        .autocommissioning     = false,
        .poll_period           = DEFAULT_POLL_PERIOD,
        .default_child_timeout = DEFAULT_CHILD_TIMEOUT,
    };

    thread_init(&thread_configuration);
    //thread_cli_init();  // DONT NEED THIS ANYMORE ->
    thread_state_changed_callback_set(state_changed_callback);
}


