patrykSilkowski/nRF52_mash/app/main.c
/**@brief Function for formating IPv6 from typedef to string.
 */
void format_ip6(char *str, const otIp6Address* addr)
{
    if(addr)
    {
        sprintf(str,"%x:%x:%x:%x:%x:%x:%x:%x",
                addr->mFields.m16[0],
                addr->mFields.m16[1],
                addr->mFields.m16[2],
                addr->mFields.m16[3],
                addr->mFields.m16[4],
                addr->mFields.m16[5],
                addr->mFields.m16[6],
                addr->mFields.m16[7]);
    }
    else
    {
        sprintf(str,"NULL");
    }
}


/**@brief Function for printing IP information via NRF_LOG(RTT).
 */
static void print_ip_info(void)
{
    char buff[128];
    const otNetifMulticastAddress *mulAddress
        = otIp6GetMulticastAddresses(thread_ot_instance_get());

    //otNetifMulticastAddress **_mulAddr = &mulAddress;
    //otNetifAddress uniAddress = otIp6GetUnicastAdresses(thread_ot_instance_get());
    if(mulAddress)
    {
        for(; mulAddress/*->mNext*/; mulAddress = mulAddress->mNext)
        {
            format_ip6(buff,&(mulAddress->mAddress));
            NRF_LOG_INFO("Multicast Address: %s", nrf_log_push(buff));
            NRF_LOG_PROCESS();
        }
    }

    const otNetifAddress *uniAddress
        = otIp6GetUnicastAddresses(thread_ot_instance_get());

    if(uniAddress)
    {
        for(; uniAddress/*->mNext*/; uniAddress=uniAddress->mNext)
        {
            format_ip6(buff,&(uniAddress->mAddress));
            NRF_LOG_INFO("Unicast Address: %s", nrf_log_push(buff));
            NRF_LOG_PROCESS();
        }
    }
}


/**@brief Callback function for initializing the joiner state.
 */
static void joiner_callback(otError aError, void *aContext)
{
    switch (aError)
    {
        case OT_ERROR_NONE:

            aError = otThreadSetEnabled(thread_ot_instance_get(), true);
            ASSERT(aError == OT_ERROR_NONE);  // TODO is this a good idea?

            NRF_LOG_INFO("Joiner: network found");
            app_sched_event_put(NULL, 0, sched_print_ip);

            m_gateway_search_tries = SEARCH_GATEWAY_TRIES; // TODO find better way
            uint32_t err_code = app_sched_event_put(NULL,
                                                    0,
                                                    sched_mqttsn_gw_search);
            APP_ERROR_CHECK(err_code);

        break;

        case OT_ERROR_SECURITY:
            NRF_LOG_ERROR("Joiner: failed - credentials");
        break;

        case OT_ERROR_NOT_FOUND:
            NRF_LOG_ERROR("Joiner: failed - no network");
        break;

        case OT_ERROR_RESPONSE_TIMEOUT:
            NRF_LOG_ERROR("Joiner: failed - timeout");
        break;

        case OT_ERROR_INVALID_STATE:
            NRF_LOG_ERROR("Joiner: failed - invalid state");
        break;

        default:
        break;
    }

    if (aError != OT_ERROR_NONE)
    {
        m_ot_join_tries--;

        if (m_ot_join_tries > 0)
        {
            uint32_t err_code = app_sched_event_put(NULL, 0, sched_joiner);
            APP_ERROR_CHECK(err_code);

            NRF_LOG_INFO("Trying to join the network once again, tries left:%d",
                         m_ot_join_tries - 1);
        }
        else
        {
            NRF_LOG_ERROR("Commissioning failed!\r\nRebooting the device!");
            NRF_LOG_FLUSH();
            NVIC_SystemReset(); // reboot
        }
    }
}


/**@brief Function for initializing the joiner state.
 */
static void joiner_start(void * p_context)
{
    otError ret = otJoinerStart(thread_ot_instance_get(),
                                JOINER_PSKD,
                                NULL,
                                VENDOR_NAME,
                                VENDOR_MODEL,
                                VENDOR_SW_VER,
                                VENDOR_DATA,
                                joiner_callback,
                                p_context);

    switch(ret)
    {
        case OT_ERROR_NONE:
            NRF_LOG_INFO("Joiner: enabled");
        break;

        case OT_ERROR_INVALID_ARGS:
            NRF_LOG_ERROR("Joiner: failed - aPSKd or a ProvisioningUrl is invalid.");
        break;

        case OT_ERROR_DISABLED_FEATURE:
            NRF_LOG_ERROR("Joiner: disabled");
        break;

        default:
        break;
    }
}




































/***************************************************************************************************
 * @section MQTT-SN
 **************************************************************************************************/


static char str_eui[17]; // TODO Move that to somewhere else

/**@brief Function for printing device commission data
 * (eui64 and QRcode to generate pattern)
 */
static void print_commissioning_info(void)
{
    otExtAddress eui64;

    otLinkGetFactoryAssignedIeeeEui64(thread_ot_instance_get(), &eui64);

    NRF_LOG_PROCESS();
    NRF_LOG_FLUSH();

    sprintf(str_eui,"%x%x%x%x%x%x%x%x",
            eui64.m8[0],
            eui64.m8[1],
            eui64.m8[2],
            eui64.m8[3],
            eui64.m8[4],
            eui64.m8[5],
            eui64.m8[6],
            eui64.m8[7]);

    NRF_LOG_INFO("\r\nEUI64:%s",str_eui);
    NRF_LOG_INFO("QRCODE: v=1&&eui=%s&&cc=%s", str_eui, JOINER_PSKD);
    NRF_LOG_INFO("sudo wpanctl commissioner -a %s %s\r\n", JOINER_PSKD, str_eui);
    NRF_LOG_PROCESS();
}


/**@brief Initializes MQTT-SN client's connection options.
 */
static void connect_opt_init(void)
{
    m_connect_opt.alive_duration = MQTTSN_DEFAULT_ALIVE_DURATION,
    m_connect_opt.clean_session  = MQTTSN_DEFAULT_CLEAN_SESSION_FLAG,
    m_connect_opt.will_flag      = MQTTSN_DEFAULT_WILL_FLAG,
    m_connect_opt.client_id_len  = strlen(m_client_id),

    memcpy(m_connect_opt.p_client_id, (unsigned char *)m_client_id, m_connect_opt.client_id_len);
}


/**@brief Processes GWINFO message from a gateway.
 *
 * @details This function updates MQTT-SN Gateway information.
 *
 * @param[in]    p_event  Pointer to MQTT-SN event.
 */
static void gateway_info_callback(mqttsn_event_t * p_event)
{
    m_gateway_addr = *(p_event->event_data.connected.p_gateway_addr);
    m_gateway_id   = p_event->event_data.connected.gateway_id;
}


