patrykSilkowski/nRF52_mash/app/main.c
/**@brief Function for checking the commissioning status. Triggers the joiner
 * status if the device is not already commissioned.
 */
static void commission_check(void)
{
    if (!otDatasetIsCommissioned(thread_ot_instance_get()))
    {
        NRF_LOG_INFO("Device is not commissioned yet!");

        print_commissioning_info();
        m_ot_join_tries = OT_JOIN_TRIES; // TODO find more elegant way
        app_sched_event_put(NULL, 0, sched_joiner);
    }
    else
    {
        NRF_LOG_INFO("Device successfully commissioned!");
        app_sched_event_put(NULL, 0, sched_print_ip);
    }

    NRF_LOG_PROCESS();
}


/**@brief Processes results of failure to find gateway in specified time.
 *
 * @details This function will try to search for the gateway once again
 *
 * @param[in]    p_event  Pointer to MQTT-SN event.
 */
static void search_gateway_timeout_callback(mqttsn_event_t * p_event)
{
    NRF_LOG_INFO("MQTT-SN event: Gateway discovery result: 0x%x.\r\n",
                 p_event->event_data.discovery);

    if (MQTTSN_SEARCH_GATEWAY_FINISHED == p_event->event_data.discovery)
    {
        //gateway already discovered
    }
    else
    {
        // there are still plenty to parse from 'mqttsn_event_searchgw_t'
        // here just try once again
        m_gateway_search_tries--;

        if (m_gateway_search_tries > 0)
        {
            uint32_t err_code = app_sched_event_put(NULL,
                                                    0,
                                                    sched_mqttsn_gw_search);
            APP_ERROR_CHECK(err_code);

            NRF_LOG_INFO("Trying to discover the gateway once again, tries left:%d",
                         m_gateway_search_tries - 1);
        }
        else
        {
            // ask for commissioning to other network
            if (OT_ERROR_NONE == otThreadBecomeDetached(thread_ot_instance_get()))
            {
                commission_check();
            }
            else
            {
                // we've got a serious problem, reboot
                NVIC_SystemReset();
            }
        }
    }
}






















/**@brief Processes CONNACK message from a gateway.
 *
 * @details This function launches the topic registration procedure if necessary.
 */
static void connected_callback(void)
{

    // TODO
    // THIS IS THE PLASE WHERE THE CREATION OF SELF SERVICES WILL BE
    // INITIALIZED
    uint32_t err_code = mqttsn_client_topic_register(&m_client,
                                                     m_topic_pub.p_topic_name,
                                                     strlen(m_topic_name_pub),
                                                     &m_msg_id);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("REGISTER message could not be sent. Error code: 0x%x\r\n", err_code);
    }
}


/**@brief Processes DISCONNECT message from a gateway. */
static void disconnected_callback(void)
{
    return;
}


static void subscribe()
{
    uint8_t  topic_name_len = strlen(m_topic_name_sub);
    uint32_t err_code = mqttsn_client_subscribe(&m_client,
        m_topic_sub.p_topic_name, topic_name_len, &m_msg_id);
    if (err_code != NRF_SUCCESS)
    {
        NRF_LOG_ERROR("SUBSCRIBE message could not be sent.\r\n");
    }
    else
    {
        NRF_LOG_INFO("SUBSCRIBE message successfully sent.");
    }
}


/**@brief Processes REGACK message from a gateway.
 *
 * @param[in] p_event Pointer to MQTT-SN event.
 */
static void regack_callback(mqttsn_event_t * p_event)
{
    NRF_LOG_INFO("MQTT-SN event: Topic has been registered with ID: %d.\r\n",
                 p_event->event_data.registered.packet.topic.topic_id);

    // register subscriber if not already registered
    if (!g_sub_registered)
    {
        m_topic_pub.topic_id = p_event->event_data.registered.packet.topic.topic_id;

        g_sub_registered = true;

        uint32_t err_code = mqttsn_client_topic_register(&m_client,
                                                     m_topic_sub.p_topic_name,
                                                     strlen(m_topic_name_sub),
                                                     &m_msg_id);
        if (err_code != NRF_SUCCESS)
        {
            NRF_LOG_ERROR("REGISTER message could not be sent. Error code: 0x%x\r\n", err_code);
        }
        else
        {
            NRF_LOG_INFO("REGISTER message successfully sent.");
        }
    }
    else
    {
        // store id
        m_topic_sub.topic_id = p_event->event_data.registered.packet.topic.topic_id;

        // subscribe
        subscribe();
    }
}


/**@brief Processes retransmission limit reached event. */
static void timeout_callback(mqttsn_event_t * p_event)
{
    NRF_LOG_INFO("MQTT-SN event: Timed-out message: %d. Message ID: %d.\r\n",
                  p_event->event_data.error.msg_type,
                  p_event->event_data.error.msg_id);
}



/**@brief Processes data published by a broker.
 *
 * @details This function processes LED command.
 */
static void received_callback(mqttsn_event_t * p_event)
{
    if (p_event->event_data.published.packet.topic.topic_id == m_topic_sub.topic_id)
    {
        uint8_t* p_data = p_event->event_data.published.p_payload;
        NRF_LOG_INFO("MQTT-SN event: Content to subscribed topic received.\r\n");
        NRF_LOG_INFO("Topic id: %d, data: %5s",
            p_event->event_data.published.packet.topic.topic_id,
            p_data);

        // turn LEDs on/off
        if (p_data[0] == '1') {
            LEDS_ON(BSP_LED_2_MASK);
            g_led_2_on = true;
        }
        else {
            LEDS_OFF(BSP_LED_2_MASK);
            g_led_2_on = false;
        }
    }
    else
    {
        NRF_LOG_INFO("MQTT-SN event: Content to unsubscribed topic received. Dropping packet.\r\n");
    }
}

/**@brief Function for handling MQTT-SN events. */
void mqttsn_evt_handler(mqttsn_client_t * p_client, mqttsn_event_t * p_event)
{
    switch(p_event->event_id)
    {
        case MQTTSN_EVENT_GATEWAY_FOUND:
            NRF_LOG_INFO("MQTT-SN event: Client has found an active gateway.\r\n");
            gateway_info_callback(p_event);
            break;

        case MQTTSN_EVENT_CONNECTED:
            NRF_LOG_INFO("MQTT-SN event: Client connected.\r\n");
            connected_callback();
            break;

